In [1]:
import pandas as pd

In [2]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

--------------------------------------------------------------------------------------------------------------------------------------

--------------------------------------------------------------------------------------------------------------------------------------

--------------------------------------------------------------------------------------------------------------------------------------

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [7]:
a=[4,8,15,16,23,42]

s=pd.Series(list(a))

s

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [8]:
listt=[2,4,6,8,10,12,14,16,18,20]

see=pd.Series(listt)

print(see)

0     2
1     4
2     6
3     8
4    10
5    12
6    14
7    16
8    18
9    20
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

In [10]:
data=pd.DataFrame({'Name':['Alice','Bob','Claire'],
                   'Age' :[25,30,27],
                   'Gender':['Female','Male','Female']
                  })

In [11]:
data

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

* DataFrame

--> DataFrame is structured form of whole data.

--> With the help of DataFrame we canvert the non-structured data into structued data.

--> Series is a part of DataFrame.

--> DataFrame represents the whole data and on other side Series represents a perticular coloumn or a singel line of data,this is the mejor diffrence between       them.

--> We use 'pd.DataFrame' function to creat DataFrame and 'pd.Series' is used to creat Series.

In [16]:
df =pd.DataFrame({'a':[1,2,3,4],
       'b':[5,6,7,8],
       'c':['Mayur','Patan','Kuldeep','Uday']
      })

sr=pd.Series(listt)

In [17]:
# This is DataFrame
df

   a  b        c
0  1  5    Mayur
1  2  6    Patan
2  3  7  Kuldeep
3  4  8     Uday

In [18]:
# This is Series
sr

0     2
1     4
2     6
3     8
4    10
5    12
6    14
7    16
8    18
9    20
dtype: int64

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

--> There is many function in Pandas library.

--> That makes our work very easy.

* Thos functions are written below.

(1) .drop()

(2) .dropna()

(3) .fillna()

(4) .merge()

(5) .set_index()

(6) .reset_index()

(7) .mean()

(8) .median()

(9) .mode()

(10).applt

* Example

Function : .apply()

--> .apply() is a very important function to manipulate on DataFrame.

--> With the help of this function we can apply different types of function on the DataFrame.

--> We can apply our own function on DataFrame with the help of .apply() function.

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

--> A mutable object can change after creat that and immutable object can't be changed after once it created. 

* According to above defination Series and DataFrame both are mutable object in Pandas.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [20]:
l1=['Mayur','Prashant','Uday']
l2=[18,19,17]
l3=[13,12,13]


s1=pd.Series(l1)
s2=pd.Series(l2)
s3=pd.Series(l3)

df=pd.DataFrame({'Name':s1,
                 'Age':s2,
                 'STD':s3})

In [21]:
df

       Name  Age  STD
0     Mayur   18   13
1  Prashant   19   12
2      Uday   17   13

* Explaination :
    
--> First of all I creat three lists,which contian Name,Age and STD.

--> With the help of this lists I creat three series using pd.Series function.

--> Last but not least I creat DataFrame using those multiple series.